# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре. Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Необходимо использовать написанную ранее функцию int_func().

def int_func(string_low:str) -> str:

    """
    Функция принимает строку из маленьких символов и возвращает строку где каждое слово начинается с большой буквы.
    :param : string_low:str
    :return: str
    """
    return string_low.title()

print(int_func('hello how are you'))