#7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение. При вызове функции должен создаваться объект-генератор.
# Функция должна вызываться следующим образом: for el in fibo_gen(). Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые 15 чисел.
#Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.

n = 0

def fibo_gen(number:int) -> int:

    '''
    Функция выдает значение счетчика для подсчета факториала.
    :param
    :return: int
    '''

    yield n + 1

count_7 = 0
for el in fibo_gen():
    print()

    if count_7 > 15:
        break
    count_7 +=1
